{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"1662456432db43ef19":{"type":"image-banner","disabled":true,"blocks":{"166245643264a49672-0":{"type":"heading","disabled":true,"settings":{"heading":"Image banner","heading_size":"h1"}}},"block_order":["166245643264a49672-0"],"settings":{"margin_top":0,"margin_bottom":0,"image":"shopify:\/\/shop_images\/Collection-page-small-banner_2_5c450610-6d81-46a1-beaf-5969d7e1bf1c.png","image_mob":"shopify:\/\/shop_images\/Collection-page-small-banner_2_5c450610-6d81-46a1-beaf-5969d7e1bf1c.png","image_url":"","image_overlay_opacity":0,"image_height":"small","adapt_height_first_image":true,"desktop_content_position":"middle-center","show_text_box":false,"desktop_content_alignment":"center","color_scheme":"background-1","mobile_content_alignment":"center","stack_images_on_mobile":true,"show_text_below":false}},"166245649120e01326":{"type":"rich-text","disabled":true,"blocks":{"1662456491370b940c-0":{"type":"heading","settings":{"heading":"<p>Treasures to boost your mood<\/p>","heading_size":"h1"}},"1662456491370b940c-1":{"type":"text","settings":{"text":"<p>A combination of vivid blues, neutral creams, earth tones and peachy pinks set the color palette for FW22 Drop 2. Get ready to embrace crisper days and allow our outerwear arrivals to help you set the mood. <\/p>"}},"1662456491370b940c-2":{"type":"button","settings":{"button_label":"Drop 2","button_link":"shopify:\/\/collections\/drop-2","button_style_secondary":false,"button_label_2":"","button_link_2":"","button_style_secondary_2":false}}},"block_order":["1662456491370b940c-0","1662456491370b940c-1","1662456491370b940c-2"],"settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"background-1","full_width":true,"padding_top":40,"padding_bottom":52}},"1662456499f9369447":{"type":"image-banner","disabled":true,"blocks":{"16624564990bb3d953-0":{"type":"heading","disabled":true,"settings":{"heading":"Image banner","heading_size":"h1"}},"16624564990bb3d953-1":{"type":"text","disabled":true,"settings":{"text":"Give customers details about the banner image(s) or content on the template.","text_style":"body"}},"16624564990bb3d953-2":{"type":"buttons","disabled":true,"settings":{"button_label_1":"Button label","button_link_1":"","button_style_secondary_1":false,"button_label_2":"Button label","button_link_2":"","button_style_secondary_2":false}}},"block_order":["16624564990bb3d953-0","16624564990bb3d953-1","16624564990bb3d953-2"],"settings":{"margin_top":0,"margin_bottom":0,"image":"shopify:\/\/shop_images\/Collection-Page-big-banner_635db919-9884-4b44-81ef-c89f7fe0befb.png","image_mob":"shopify:\/\/shop_images\/Collection-Page-big-banner_635db919-9884-4b44-81ef-c89f7fe0befb.png","image_url":"","image_overlay_opacity":0,"image_height":"large","adapt_height_first_image":true,"desktop_content_position":"middle-center","show_text_box":false,"desktop_content_alignment":"center","color_scheme":"background-1","mobile_content_alignment":"center","stack_images_on_mobile":true,"show_text_below":false}},"9eb42d3d-e0c0-4ff6-9ed2-6ad9518e7455":{"type":"faq","blocks":{"d34e2dea-c770-48ba-aefa-bf8d25d36362":{"type":"block","settings":{"title":"SHIPPING & DELIVERY","question1":"What is the estimated delivery time?","answer1":"<p>The estimated delivery time depends on the shipping country. As soon as your order is shipped, you will receive a shipping confirmation with a tracking number, so you can check the current status of your shipment.<br\/><br\/><\/p><p>Please refer to our <a href=\"https:\/\/www.beaumont.eu\/pages\/shipping-and-delivery\">\"Shipping & Delivery\"<\/a> page, where you can see the estimated delivery time per country. <\/p>","question2":"What are the shipping costs?","answer2":"<p>The estimated shipping costs depend on the shipping country.<br\/><br\/><\/p><p>We would like to refer you to our overview on the <a href=\"https:\/\/beaumont.eu\/pages\/shipping-and-delivery\" target=\"_blank\"><strong>Shipping and Delivery page<\/strong><\/a><strong> <\/strong>for more exact information.<\/p>","question3":"Can I pick up my order?","answer3":"<p>Unfortunately, it is not possible to pick up your order at our warehouse, as it is fully automated.<\/p>","question4":"My order is delayed","answer4":"<p>We strive to deliver your order within the specified delivery time. However, it may happen that an order is unexpectedly delayed.<br\/><br\/><\/p><p>For questions about delayed orders, you can contact our customer support team. You can contact us via mail, phone or chat on weekdays between 9.00hrs and 17.00hrs CET.<\/p>","question5":"What happens if a package goes missing?","answer5":"<p>Please contact our <a href=\"https:\/\/beaumont.eu\/pages\/contact\" target=\"_blank\">support team<\/a> by email or phone. We will report the missing package to our carrier. It will take 8 business days to complete the investigation. We kindly ask you to check up on your neighbours in the meantime.<br\/><br\/><\/p><p>In case your parcel remains untraceable after 8 business days, you can either receive a full refund or choose to replace your order.<\/p>","question6":"I have entered the wrong delivery address","answer6":"<p>If you need to make any amendments to your purchase, please call our <a href=\"https:\/\/beaumont.eu\/pages\/contact\" target=\"_blank\">customer support team<\/a> as soon as possible.<br\/><br\/><\/p><p>We will do our best to help you as best as possible. Depending on the status of your order, it may be possible to change the shipment address.<\/p>","question7":"What countries do you ship to?","answer7":"<p>We ship to all European countries and the United Kingdom.<br\/><br\/><\/p><p>Please check this <a href=\"https:\/\/beaumont.eu.com\/pages\/shipping-and-delivery\" target=\"_blank\"><span style=\"text-decoration:underline\">detailed breakdown<\/span><\/a> before ordering to make sure we can deliver to your geographical location.<br\/><br\/><\/p><p>In case your shipping country is not listed, please feel free to make an enquiry at our customer support. We will take your request into consideration for future purposes only.<\/p>","question8":"","answer8":"","question9":"","answer9":"","question10":"","answer10":""}},"b114867c-6a5d-4ffa-a177-af1769b6a7dc":{"type":"block","settings":{"title":"RETURNS","question1":"What is your return policy?","answer1":"<p>You may return your order within 14 days from the date of delivery. All products must be returned in a new and unused state, with all protective materials in place and tags attached to them. Please carefully handle light-coloured clothes and accessories if you are still deciding whether to keep the item.<br\/> <br\/><\/p><p>We reserve the right not to accept any return if the product shows signs of wear or has been used or altered from its original condition in any way.<br\/><br\/><\/p><p>Returns outside the timeframe of 14 days may be accepted at the discretion of Beaumont and may only be refunded as a store credit. We will only reimburse you if the return procedure is followed properly.<br\/><br\/><\/p><p>Please find the return instructions on the order overview inserted in your parcel. Or start your return <a href=\"https:\/\/beaumont.returnista.com\/nl\" target=\"_blank\"><span style=\"text-decoration:underline\">here<\/span><\/a><span style=\"text-decoration:underline\">.<br\/><br\/><\/span><\/p><p>If you wish to return your order on your own initiative, we kindly ask you to inform our <a href=\"https:\/\/beaumont.eu\/pages\/contact\" target=\"_blank\">customer support team<\/a> in advance at support@beaumont.eu. Please note that we may not accept liability for missing or defective shipments.<br\/><br\/><\/p><p>Return address:<\/p><p>Beaumont returns<\/p><p>Montapacking Oosterhout B.V.<\/p><p>Krombraak 4<\/p><p>4906 CR Oosterhout<\/p><p>The Netherlands<\/p>","question2":"How long will it take until my money is refunded?","answer2":"<p>When your return is received in good order, we will refund the purchase amount within 5 working days.<br\/><br\/><\/p><p>Your refund will be credited to the original payment method. Credit card payments will be processed within 14 days.<br\/><br\/><\/p><p>Please note that refunds can take up to 10 working days to show on your account due to varying processing times between payment providers. <\/p>","question3":"Have you received my return shipment?","answer3":"<p>We expect to process your return shipment within 5 business days of arrival in our warehouse. Once we have received your return shipment, you will be notified via email.<br\/><br\/>We strive to refund the purchase amount within 5 working days.Please be aware that the refund will be credited to the original payment method.<\/p>","question4":"I need a new return form","answer4":"<p>When you need a new return form, please contact our <a href=\"https:\/\/beaumont.eu\/pages\/contact\" target=\"_blank\">customer support team<\/a>. <\/p>","question5":"Can I exchange an item?","answer5":"<p>Unfortunately, it is not possible to exchange your order. We advise you to place a new order and return the unwanted item(s).<br\/><br\/><\/p><p>You can return your order via our <a href=\"https:\/\/beaumont.eu\/pages\/returns-and-exchanges\" target=\"_blank\"><span style=\"text-decoration:underline\">return page<\/span><\/a>.<\/p>","question6":"","answer6":"","question7":"","answer7":"","question8":"","answer8":"","question9":"","answer9":"","question10":"","answer10":""}},"b4fdb507-285e-4f5b-b2a5-319bcc38ca66":{"type":"block","settings":{"title":"ORDERS","question1":"Can I amend the shipment address from my order?","answer1":"<p>If you need to make any amendments to your purchase, please call our customer support team as soon as possible. We will do our best to help you as best as possible. Depending on the status of your order, it may be possible to change the shipment address.<\/p>","question2":"Can I amend or cancel an item from my order?","answer2":"<p>There is only a short amount of time between when you place your order and when we start processing it, so we can guarantee fast delivery. If you contact our customer support straight away after ordering, we may be able to cancel or alter your order before it’s processed.<br\/><br\/><\/p><p>In case your order is already being processed, we will despatch your order and then you can return it to us if you wish upon receiving it. We accept returns within 14 days after the day of receipt.<br\/><br\/><\/p><p>Unfortunately, we are not able to combine or add an item to an existing order. If you need to order a greater quantity or an additional product, please place a new order online.<\/p>","question3":"Can I place an order without creating an account?","answer3":"<p>You can place an order as a guest with no obligation to create an account. We do recommend that you create an account, if you would like to check your order history and have your shopping basket items and payment details saved for next time.<br\/><br\/><\/p><p>It’s quick and easy to create an account. Just visit<a href=\"https:\/\/beaumont.eu\/account\/login\"> https:\/\/beaumont.eu\/account\/login<\/a> and follow the instructions.<\/p>","question4":"Why has my order been canceled?","answer4":"<p>We typically only cancel orders if there’s a problem with stock, or if you’ve asked us to cancel. Please accept our apologies if your order is canceled because of a problem at our end. We’ll always offer an alternative product and process your refund in full, as quickly as possible.<\/p>","question5":"I have not received a confirmation email","answer5":"<p>Your order confirmation is automatically sent to your email address when you place an order. It could be the unlikely circumstance that your email ends up on your spam box or junk mail. If the confirmation mail ends up in your spam box, please whitelist our email address: <strong>info@beaumont.eu<br\/><br\/><\/strong><\/p><p>If you haven’t received your order confirmation within 24 hours, please get in touch with our customer support team just in case there’s a problem with your order. Please check your mailbox’s spam or junk folder before contacting in case the order confirmation has been diverted there.<\/p>","question6":"Can I track my order?","answer6":"<p>In your delivery confirmation emails, you’ll receive a tracking reference which you can use to check the progress of your order online. You can track the status of your order to find out where it currently is and when it will get delivered at any time using this tracking number.<\/p>","question7":"I have a promotional code, but it is not working.","answer7":"<p>Please pay attention to the correct spelling of the code and make sure that it is intended for use in your country\/currency.<br\/><br\/><\/p><p>If your code does not work, please contact our <a href=\"https:\/\/beaumont.eu\/pages\/contact\" target=\"_blank\">customer support team<\/a>, so we can help out further.<\/p>","question8":"","answer8":"","question9":"","answer9":"","question10":"","answer10":""}},"a8c3de0f-b799-4839-b5c1-6abdde101cdf":{"type":"block","settings":{"title":"PAYMENTS","question1":"What payment methods are available?","answer1":"<p>Depending on what country your order is being shipped to, Beaumont accepts various payment methods. We accept credit cards for most countries.<br\/><br\/><strong>Credit cards:<\/strong> Visa, American Express, MasterCard, Cartes Bancaires, Visa Electron, Maestro. <br\/><br\/><strong>Other:<\/strong> Paypal, Klarna Slice it, Apple Pay, Google Pay.<br\/><br\/><strong>Local payment providers: <\/strong>iDEAL, Bancontact, EPS and Sofort. <br\/><br\/>Our transactions are carried out by Shopify Payments.  <\/p>","question2":"Is it possible to make a manual transfer through my bank?","answer2":"<p>Unfortunately, all transactions made are carried out by our payment provider Mollie. It is therefore not possible to make manual transfers or deposits by bank.<\/p>","question3":"","answer3":"","question4":"","answer4":"","question5":"","answer5":"","question6":"","answer6":"","question7":"","answer7":"","question8":"","answer8":"","question9":"","answer9":"","question10":"","answer10":""}},"6c7d42ce-dca1-4288-b81a-b6171701dde3":{"type":"block","settings":{"title":"PRODUCT INFORMATION","question1":"I have received the wrong product","answer1":"<p>Our apologies for the inconvenience. Please get in touch with our support team via e-mail, phone or chat. <br\/><br\/>We will provide you with a free shipping label to return the wrong item to our warehouse and send the missing item upon stock availability. <br\/><br\/>Otherwise, we will refund the item to your original payment method.<\/p>","question2":"I have received a damaged product","answer2":"<p>We apologize for the inconvenience. Please get in touch with our support department within 24 hours after receiving your order via <strong>support@beaumont.eu. <br\/><br\/><\/strong>Please share in your email your order number, item number (optional), and a description of the defect. Attach photos of the damage. <br\/><br\/>Once you have submitted your request to us, our experts will analyze your damaged item and provide initial feedback based on the information provided. <br\/><br\/>We will make an exchange upon stock availability. Otherwise we will refund the item cost to your original payment method.<\/p>","question3":"I am missing a product in my order","answer3":"<p>Our apologies for the inconvenience. Please get in touch with our support team via email, phone or chat. <br\/><br\/>We will send the missing item upon stock availability. Otherwise we will refund the item cost to your original payment method. <\/p>","question4":"The product looks different on the website","answer4":"<p>We are sorry to hear that the product does not meet your expectations. We do our outmost best to display all products truthfully on our website. <br\/><br\/>If you just don’t like the product for any reason, we’ll gladly accept it back as a return, providing it’s in “as new” condition, in its original packaging with all labels attached. <br\/><br\/>Please feel free to contact us via email, phone or chat. We will do our best to give you the guidance and advice for your future purchase.<\/p>","question5":"Will sold out items be restocked?","answer5":"<p>Some of the non-seasonal items are carried out throughout the year and will therefore be restocked in time. <br\/><br\/>We advise you to sign up for our 'notify when in stock’ feature on the product page. You will be notified automatically when your favorite item has been restocked in your size. Please note that we cannot guarantee that the item you have chosen will be restocked. <br\/><br\/>Please note, items from previous collections are not restocked.  <\/p>","question6":"Warranty policy","answer6":"<p>Beaumont products are made with the highest quality materials and craftsmanship. If by any means the product shows a trace of manufacturing defect within two years after purchase date, please reach out to our customer support team. <br\/><br\/>Beaumont products purchased from an Authorized Retailer are handled by the retailer. Please contact your salespersons directly to handle any manufacturing defect. <br\/><br\/>We only offer warranty for Beaumont items purchased online in the official brandstore. Please mind that any defects submitted two years after purchase are not taken into consideration. <br\/><br\/>In order to qualify for a warranty, please contact our support department via support@beaumont.eu. Share in your email your order number, item number (optional), and a description of the defect. Attach photos of the damage. <br\/><br\/>Once you have submitted your request to us, our experts will analyze your damaged item and provide feedback based on the information provided. <br\/><br\/>If your warranty request meets the requirements, our team will repair the product free of charge, or replace it at our discretion. <br\/><br\/>If the product is not repairable, or the cost of the repair exceeds the value of the product, we may choose to replace the product instead. <br\/><br\/>If the exact style is not available for replacement, a product of equal value and similar style will be provided. <br\/><br\/>Please note, knitwear, footwear, accessories and collaborations are excluded from the Beaumont warranty program, unless otherwise stated. <br\/><br\/>This warranty does not cover any repairs needed due to accidents, improper care, negligence, or normal wear and tear. <br\/><br\/>For any damage not covered under the warranty, Beaumont may offer to repair the damage for a reasonable charge. If such an offer is made, we will discuss this with the consumer, prior to any repairs being made. <br\/><br\/>We understand you may wish to alter or modify your Beaumont item to suit your body or needs. Unfortunately we do not have the capacity to perform custom alterations or modifications at this time. Nor do we compensate for the costs. <br\/><br\/>For general warranty inquiries feel free to contact our<a href=\"https:\/\/beaumont.eu\/pages\/contact\" target=\"_blank\">support team<\/a>. All case updates and\/or repair decisions, will be available to you in your case, after your garment has completed inspection.<\/p>","question7":"","answer7":"","question8":"","answer8":"","question9":"","answer9":"","question10":"","answer10":""}},"3bdbe27b-5ed9-4076-ade2-1f3f49524ae4":{"type":"block","settings":{"title":"MY ACCOUNT","question1":"I have forgotten my password","answer1":"<p>If you have forgotten your password, you can click on the forgot my password link on the login screen. After entering your e-mail address, you will receive an e-mail to reset your password. <br\/><br\/>How to enter the login screen?<br\/><br\/>Click on the symbol ‘My Account’ on the upper right part of the webpage in order to enter the login screen. <br\/><br\/>Alternatively, click on the <span style=\"text-decoration:underline\">log in<\/span> link in the first step of the checkout in order to enter the login screen.   <\/p>","question2":"How can I unsubscribe from the newsletter?","answer2":"<p>If you no longer wish to receive our newsletter, you can unsubscribe by clicking on the unsubscribe link at the bottom of the newsletter. This will open a form in which you can specify your communication preference.<\/p>","question3":"","answer3":"","question4":"","answer4":"","question5":"","answer5":"","question6":"","answer6":"","question7":"","answer7":"","question8":"","answer8":"","question9":"","answer9":"","question10":"","answer10":""}}},"block_order":["d34e2dea-c770-48ba-aefa-bf8d25d36362","b114867c-6a5d-4ffa-a177-af1769b6a7dc","b4fdb507-285e-4f5b-b2a5-319bcc38ca66","a8c3de0f-b799-4839-b5c1-6abdde101cdf","6c7d42ce-dca1-4288-b81a-b6171701dde3","3bdbe27b-5ed9-4076-ade2-1f3f49524ae4"],"settings":{"heading":"FAQ","heading_background":"","heading_color":"","tab_hover":"","tab_color":"","faq_icon_color":"","question_color":"","answer_color":"","faq_heading_color":""}}},"order":["main","1662456432db43ef19","166245649120e01326","1662456499f9369447","9eb42d3d-e0c0-4ff6-9ed2-6ad9518e7455"]}